<?php
/******************************
COPY RIGHT BY TCV Portal
******************************/

	global $utf82telex, $utf82latin,$utf82tcvn3;
	$utf82telex=array(
		'à'=>'af',
		'á'=>'as',
		'ả'=>'ar',
		'ã'=>'ax',
		'ạ'=>'aj',
		
		'ă'=>'aw',
		'ằ'=>'awf',
		'ắ'=>'aws',
		'ẳ'=>'awr',
		'ẵ'=>'awx',
		'ặ'=>'awj',

		'â'=>'aa',		
		'ầ'=>'aaf',
		'ấ'=>'aas',
		'ẩ'=>'aar',
		'ẫ'=>'aax',
		'ậ'=>'aaj',

		'đ'=>'dd',

		'è'=>'ef',
		'é'=>'es',
		'ẻ'=>'er',
		'ẽ'=>'ex',
		'ẹ'=>'ej',

		'ê'=>'ee',		
		'ề'=>'eef',
		'ế'=>'ees',
		'ể'=>'eer',
		'ễ'=>'eex',
		'ệ'=>'eej',

		'ì'=>'if',
		'í'=>'is',
		'ỉ'=>'ir',
		'ĩ'=>'ix',
		'ị'=>'ij',

		'ò'=>'of',
		'ó'=>'os',
		'ỏ'=>'or',
		'õ'=>'ox',
		'ọ'=>'oj',

		'ô'=>'oo',		
		'ồ'=>'oof',
		'ố'=>'oos',
		'ổ'=>'oor',
		'ỗ'=>'oox',
		'ộ'=>'ooj',

		'ơ'=>'ow',		
		'ờ'=>'owf',
		'ớ'=>'ows',
		'ở'=>'owr',
		'ỡ'=>'owx',
		'ợ'=>'owj',

		'ù'=>'uf',
		'ú'=>'us',
		'ủ'=>'ur',
		'ũ'=>'ux',
		'ụ'=>'uj',

		'ư'=>'uw',		
		'ừ'=>'uwf',
		'ứ'=>'uws',
		'ử'=>'uwr',
		'ữ'=>'uwx',
		'ự'=>'uwj',

		'À'=>'af',
		'Á'=>'as',
		'Ả'=>'ar',
		'Ã'=>'ax',
		'Ạ'=>'aj',
		
		'Ă'=>'aw',
		'Ằ'=>'awf',
		'Ắ'=>'aws',
		'Ẳ'=>'awr',
		'Ẵ'=>'awx',
		'Ặ'=>'awj',

		'Â'=>'aa',		
		'Ầ'=>'aaf',
		'Ấ'=>'aas',
		'Ẩ'=>'aar',
		'Ẫ'=>'aax',
		'Ậ'=>'aaj',

		'Đ'=>'dd',

		'È'=>'ef',
		'É'=>'es',
		'Ẻ'=>'er',
		'Ẽ'=>'ex',
		'Ẹ'=>'ej',

		'Ê'=>'ee',		
		'Ề'=>'eef',
		'Ế'=>'ees',
		'Ể'=>'eer',
		'Ễ'=>'eex',
		'Ệ'=>'eej',

		'Ì'=>'if',
		'Í'=>'is',
		'Ỉ'=>'ir',
		'Ĩ'=>'ix',
		'Ị'=>'ij',

		'Ò'=>'of',
		'Ó'=>'os',
		'Ỏ'=>'or',
		'Õ'=>'ox',
		'Ọ'=>'oj',

		'Ô'=>'oo',		
		'Ồ'=>'oof',
		'Ố'=>'oos',
		'Ổ'=>'oor',
		'Ỗ'=>'oox',
		'Ộ'=>'ooj',

		'Ơ'=>'ow',		
		'Ờ'=>'owf',
		'Ớ'=>'ows',
		'Ở'=>'owr',
		'Ỡ'=>'owx',
		'Ợ'=>'owj',

		'Ù'=>'uf',
		'Ú'=>'us',
		'Ủ'=>'ur',
		'Ũ'=>'ux',
		'Ụ'=>'uj',

		'Ư'=>'uw',		
		'Ừ'=>'uwf',
		'Ứ'=>'uws',
		'Ử'=>'uwr',
		'Ữ'=>'uwx',
		'Ự'=>'uwj',

		'ỳ'=>'yf',
		'ý'=>'ys',
		'ỷ'=>'yr',
		'ỹ'=>'yx',
		'ỵ'=>'yj',
		
		'À'=>'af',
		'Á'=>'as',
		'Ả'=>'ar',
		'Ã'=>'ax',
		'Ạ'=>'aj',
		
		'Ă'=>'aw',
		'Ằ'=>'awf',
		'Ắ'=>'aws',
		'Ẳ'=>'awr',
		'Ẵ'=>'awx',
		'Ặ'=>'awj',

		'Â'=>'aa',		
		'Ầ'=>'aaf',
		'Ấ'=>'aas',
		'Ẩ'=>'aar',
		'Ẫ'=>'aax',
		'Ậ'=>'aaj',

		'Đ'=>'dd',

		'È'=>'ef',
		'É'=>'es',
		'Ẻ'=>'er',
		'Ẽ'=>'ex',
		'Ẹ'=>'ej',

		'Ê'=>'ee',		
		'Ề'=>'eef',
		'Ế'=>'ees',
		'Ể'=>'eer',
		'Ễ'=>'eex',
		'Ệ'=>'eej',

		'Ì'=>'if',
		'Í'=>'is',
		'Ỉ'=>'ir',
		'Ĩ'=>'ix',
		'Ị'=>'ij',

		'Ò'=>'of',
		'Ó'=>'os',
		'Ỏ'=>'or',
		'Õ'=>'ox',
		'Ọ'=>'oj',

		'Ô'=>'oo',		
		'Ồ'=>'oof',
		'Ố'=>'oos',
		'Ổ'=>'oor',
		'Ỗ'=>'oox',
		'Ộ'=>'ooj',

		'Ơ'=>'ow',		
		'Ờ'=>'owf',
		'Ớ'=>'ows',
		'Ở'=>'owr',
		'Ỡ'=>'owx',
		'Ợ'=>'owj',

		'Ù'=>'uf',
		'Ú'=>'us',
		'Ủ'=>'ur',
		'Ũ'=>'ux',
		'Ụ'=>'uj',

		'Ư'=>'uw',		
		'Ừ'=>'uwf',
		'Ứ'=>'uws',
		'Ử'=>'uwr',
		'Ữ'=>'uwx',
		'Ự'=>'uwj',
		
		'Ỳ'=>'yf',
		'Ý'=>'ys',
		'Ỷ'=>'yr',
		'Ỹ'=>'yx',
		'Ỵ'=>'yj'

	);
	foreach($utf82telex as $char=>$new_char)
	{
		$utf82latin[$char] = $new_char{0};
	}
	$utf82tcvn3=array(
		'à'=>'µ',
		'á'=>'¸',
		'ả'=>'¶',
		'ã'=>'·',
		'ạ'=>'¹',
		
		'ă'=>'¨',
		'ằ'=>'»',
		'ắ'=>'¾',
		'ẳ'=>'¼',
		'ẵ'=>'½',
		'ặ'=>'Æ',

		'â'=>'©',		
		'ầ'=>'Ç',
		'ấ'=>'Ê',
		'ẩ'=>'È',
		'ẫ'=>'É',
		'ậ'=>'Ë',

		'đ'=>'®',

		'è'=>'Ì',
		'é'=>'Ð',
		'ẻ'=>'Î',
		'ẽ'=>'Ï',
		'ẹ'=>'Ñ',

		'ê'=>'ª',		
		'ề'=>'Ò',
		'ế'=>'Õ',
		'ể'=>'Ó',
		'ễ'=>'Ô',
		'ệ'=>'Ö',

		'ì'=>'×',
		'í'=>'Ý',
		'ỉ'=>'Ø',
		'ĩ'=>'Ü',
		'ị'=>'Þ',

		'ò'=>'ß',
		'ó'=>'ã',
		'ỏ'=>'á',
		'õ'=>'â',
		'ọ'=>'ä',

		'ô'=>'«',		
		'ồ'=>'å',
		'ố'=>'è',
		'ổ'=>'æ',
		'ỗ'=>'ç',
		'ộ'=>'é',

		'ơ'=>'¬',		
		'ờ'=>'ê',
		'ớ'=>'í',
		'ở'=>'ë',
		'ỡ'=>'ì',
		'ợ'=>'î',

		'ù'=>'ï',
		'ú'=>'ó',
		'ủ'=>'ñ',
		'ũ'=>'ò',
		'ụ'=>'ô',

		'ư'=>'­',		
		'ừ'=>'õ',
		'ứ'=>'ø',
		'ử'=>'ö',
		'ữ'=>'÷',
		'ự'=>'ù',

		'À'=>'µ',
		'Á'=>'¸',
		'Ả'=>'¶',
		'Ã'=>'·',
		'Ạ'=>'¹',
		
		'Ă'=>'¡',
		'Ằ'=>'»',
		'Ắ'=>'ø',
		'Ẳ'=>'¼',
		'Ẵ'=>'½',
		'Ặ'=>'Æ',

		'Â'=>'¢',		
		'Ầ'=>'Ç',
		'Ấ'=>'Ê',
		'Ẩ'=>'È',
		'Ẫ'=>'É',
		'Ậ'=>'Ë',

		'Đ'=>'§',

		'È'=>'Ì',
		'É'=>'Ð',
		'Ẻ'=>'Î',
		'Ẽ'=>'Ï',
		'Ẹ'=>'Ñ',

		'Ê'=>'£',		
		'Ề'=>'Ò',
		'Ế'=>'Õ',
		'Ể'=>'Ó',
		'Ễ'=>'Ô',
		'Ệ'=>'Ö',

		'Ì'=>'×',
		'Í'=>'Ý',
		'Ỉ'=>'Ø',
		'Ĩ'=>'Ü',
		'Ị'=>'Þ',

		'Ò'=>'ß',
		'Ó'=>'ã',
		'Ỏ'=>'á',
		'Õ'=>'â',
		'Ọ'=>'ä',

		'Ô'=>'¤',		
		'Ồ'=>'å',
		'Ố'=>'è',
		'Ổ'=>'æ',
		'Ỗ'=>'ç',
		'Ộ'=>'é',

		'Ơ'=>'¥',		
		'Ờ'=>'ê',
		'Ớ'=>'í',
		'Ở'=>'ë',
		'Ỡ'=>'ì',
		'Ợ'=>'î',

		'Ù'=>'ï',
		'Ú'=>'ó',
		'Ủ'=>'ñ',
		'Ũ'=>'ò',
		'Ụ'=>'ô',

		'Ư'=>'¦',		
		'Ừ'=>'õ',
		'Ứ'=>'ø',
		'Ử'=>'ö',
		'Ữ'=>'÷',
		'Ự'=>'ù',

		'ỳ'=>'ú',
		'ý'=>'ý',
		'ỷ'=>'ñ',
		'ỹ'=>'ü',
		'ỵ'=>'þ',
		
		'Ỳ'=>'ú',
		'Ý'=>'ý',
		'Ỷ'=>'û',
		'Ỹ'=>'ü',
		'Ỵ'=>'þ'

	);	
function convert_utf8_to_telex($str)
{
	global $utf82telex;
	return strtr($str,$utf82telex);
}
function convert_utf8_to_latin($str)
{
	global $utf82latin;
	return strtr($str,$utf82latin);
}
function convert_utf8_to_tcvn3($str)
{
	global $utf82tcvn3;
	return strtr($str,$utf82tcvn3);
}

function html_to_utf8 ($data)
{
    return preg_replace("/\\&\\#([0-9]{3,10})\\;/e", '_html_to_utf8("\\1")', $data);
}
function _html_to_utf8 ($data)
{
    if ($data > 127)
        {
        $i = 5;
        while (($i--) > 0)
            {
            if ($data != ($a = $data % ($p = pow(64, $i))))
                {
                $ret = chr(base_convert(str_pad(str_repeat(1, $i + 1), 8, "0"), 2, 10) + (($data - $a) / $p));
                for ($i; $i > 0; $i--)
                    $ret .= chr(128 + ((($data % pow(64, $i)) - ($data % ($p = pow(64, $i - 1)))) / $p));
                break;
                }
            }
        }
        else
        $ret = "&#$data;";
    return $ret;
}
function convert_utf8_to_url_rewrite($data)
{
	$str = convert_utf8_to_latin(trim($data));
	$str = preg_replace('/[^0-9a-zA-Z-\_]+/','-',$str);
	$str = str_replace(array('---','--'),array('-','-'),$str);
	if(substr($str,strlen($str)-1,1)=='-')
	{
		$str = substr($str,0,strlen($str)-1);
	}
	return strtolower($str);
}
function convert_utf8_to_unicode($data)
{
	return convert_utf8_to_latin($data);
}
?>